; domain
(define (domain injured-people-environment)
    (:requirements :typing :equality :negative-preconditions :existential-preconditions)
    (:types
        Loc
        Person
        Resource
        Crate
        Robot
    ) 
    (:constants FOOD MEDICINE - Resource)
    (:predicates 
        (Injured ?p)
        ; localization predicates
        (At ?x ?l) ; entity x (Robot, Crate, Person) is at Location l
        ; action-based predicates
        (Has ?x ?o)
        (Free ?r)
        (Carrying ?r ?c) ; Robot r is carrying Crate c
        (Taken ?c) ; Crate c is taken (cannot be Loaded)
    )

    ; defining the possible actions of the problem
    (:action Move ; move the robot ?r from location ?src to location ?dst
        :parameters (?r - Robot ?src - Loc ?dst - Loc)
        :precondition (and
            ; actual action constraints
            (At ?r ?src) (not (= ?src ?dst))
        )
        :effect (and 
            (not (at ?r ?src))
            (at ?r ?dst)
        )
    
    )
    (:action Load ; load the Crate ?c onto Robot ?r at Location ?l
        :parameters (?r - Robot ?c - Crate ?l - Loc)
        :precondition (and 
            ; actual action constraints
            (At ?r ?l) (At ?c ?l) (not (Carrying ?r ?c)) (not (Taken ?c)) (Free ?r)
        )
        :effect (and 
            (Carrying ?r ?c) (not (Free ?r))
        )
    )
    (:action Unload ; deliver the content of Crate ?c to Person ?p from Robot ?r when at the same Location ?l
        :parameters (?r - Robot ?c - Crate ?p - Person ?l - Loc)
        :precondition (and 
            ; actual action constraints
            (At ?r ?l) (Carrying ?r ?c) (At ?p ?l)
        )
        :effect (and 
            (not (Carrying ?r ?c)) (Free ?r) (Has ?p ?c) (At ?c ?l) (Taken ?c)
        )
    )
)

; problem
(define (problem problem_one) (:domain injured-people-environment)
(:objects 
    ; let's suppose 11 random locations directly connected to each other
    depot l0 l1 l2 l3 l4 l5 l6 l7 l8 l9 - Loc
    ; let's suppose 3 people 
    Alice Wamiq Zihadul - Person
    ; let's suppose 6 crates
    c0 c1 c2 c3 c4 c5 - Crate
    ; ... and our unique agent
    agent - Robot
)

(:init
    ;todo: put the initial state's facts and numeric values here
    ; let's suppose all People are in different locations
    (At Wamiq l0) (At Zihadul l5) (At Alice l8)
    ; every crate as well as the agent are in the 'depot'
    (At c0 depot) (At c1 depot) (At c2 depot) (At c3 depot) (At c4 depot) (At c5 depot)
    (At agent depot)
    ; random definition of crate contents
    (Has c0 FOOD) (Has c1 FOOD) (Has c2 FOOD) 
    (Has c3 MEDICINE) (Has c4 MEDICINE) (Has c5 MEDICINE)
    (Free agent)
)

(:goal (and
    ; random definition of what people need
    ; let's suppose Wamiq needs FOOD, while Zihadul and Alice need MEDICINE
    (exists (?c - Crate) (and (Has Wamiq ?c) (Has ?c FOOD)))
    (exists (?c - Crate) (and (Has Zihadul ?c) (Has ?c MEDICINE)))
    (exists (?c - Crate) (and (Has Alice ?c) (Has ?c MEDICINE)))
))

)

; plan
1. (load agent c3 depot)
   deleted: (free agent)
   added: (carrying agent c3)
   goals met: 0 of 3
2. (move agent depot l5)
   deleted: (at agent depot)
   added: (at agent l5)
   goals met: 0 of 3
3. (unload agent c3 zihadul l5)
   deleted: (carrying agent c3)
   added: (free agent) (has zihadul c3) (at c3 l5) (taken c3)
   goals met: 1 of 3
4. (move agent l5 depot)
   deleted: (at agent l5)
   added: (at agent depot)
   goals met: 1 of 3
5. (load agent c4 depot)
   deleted: (free agent)
   added: (carrying agent c4)
   goals met: 1 of 3
6. (move agent depot l8)
   deleted: (at agent depot)
   added: (at agent l8)
   goals met: 1 of 3
7. (unload agent c4 alice l8)
   deleted: (carrying agent c4)
   added: (free agent) (has alice c4) (at c4 l8) (taken c4)
   goals met: 2 of 3
8. (move agent l8 depot)
   deleted: (at agent l8)
   added: (at agent depot)
   goals met: 2 of 3
9. (load agent c0 depot)
   deleted: (free agent)
   added: (carrying agent c0)
   goals met: 2 of 3
10. (move agent depot l0)
   deleted: (at agent depot)
   added: (at agent l0)
   goals met: 2 of 3
11. (unload agent c0 wamiq l0)
   deleted: (carrying agent c0)
   added: (free agent) (has wamiq c0) (at c0 l0) (taken c0)
   goals met: 3 of 3
